In [1]:
import pandas as pd
import numpy as np
import warnings
import mysql.connector as conn
warnings.filterwarnings('ignore')

In [2]:
data = pd.read_excel('../Proyecto/data.xlsx')

In [3]:
data.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 1.1 MB

In [4]:
data.shape

(1470, 35)

In [5]:
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [6]:
#Eliminamos columnas

In [7]:
data = data.drop(['DailyRate', 'EmployeeCount', 'HourlyRate', 'MonthlyRate', 'Over18', 'StandardHours'], axis=1)
data.shape

(1470, 29)

In [8]:
data['idcategory']=''

In [9]:
data.shape

(1470, 30)

In [10]:
cat_id = []
for i in data.iterrows():
    
    if i[1][3] == 'Sales' and i[1][12]== 'Sales Executive':
        cat_id.append(2)
    
    elif i[1][3] == 'Sales' and i[1][12]== 'Manager':
        cat_id.append(1)
    
    elif i[1][3] == 'Sales' and i[1][12]== 'Sales Representative':
        cat_id.append(5)
        
    elif i[1][3] == 'Human Resources' and i[1][12]== 'Human Resources':
        cat_id.append(2)
    
    elif i[1][3] == 'Human Resources' and i[1][12]== 'Manager':
        cat_id.append(1)
    
    elif i[1][3] == 'Research & Development' and i[1][12]== 'Healthcare Representative':
        cat_id.append(3)
    
    elif i[1][3] == 'Research & Development' and i[1][12]== 'Laboratory Technician':
        cat_id.append(4)
    
    elif i[1][3] == 'Research & Development' and i[1][12]== 'Manager':
        cat_id.append(1)
        
    elif i[1][3] == 'Research & Development' and i[1][12]== 'Manufacturing Director':
        cat_id.append(1)
        
    elif i[1][3] == 'Research & Development' and i[1][12]== 'Research Director':
        cat_id.append(1)
        
    elif i[1][3] == 'Research & Development' and i[1][12]== 'Research Scientist':
        cat_id.append(6)  
        
    
len(cat_id), len(data)

(1470, 1470)

In [11]:
data.idcategory=cat_id

In [12]:
data.head()

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,Gender,...,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,idcategory
0,41,Yes,Travel_Rarely,Sales,1,2,Life Sciences,1,2,Female,...,1,0,8,0,1,6,4,0,5,2
1,49,No,Travel_Frequently,Research & Development,8,1,Life Sciences,2,3,Male,...,4,1,10,3,3,10,7,1,7,6
2,37,Yes,Travel_Rarely,Research & Development,2,2,Other,4,4,Male,...,2,0,7,3,3,0,0,0,0,4
3,33,No,Travel_Frequently,Research & Development,3,4,Life Sciences,5,4,Female,...,3,0,8,3,3,8,7,3,0,6
4,27,No,Travel_Rarely,Research & Development,2,1,Medical,7,1,Male,...,4,1,6,3,3,2,2,2,2,4

In [13]:
data["idcategory"].unique()

array([2, 6, 4, 1, 3, 5], dtype=int64)

In [14]:
#ya tenemos los datos limpias de los trabajdores. Ahora hay que ver cuantas ofertas de trabajo hay por categoria

In [15]:
#cambio de ruoias a euros

In [16]:
%pip install webdriver-manager

Requirement already satisfied: webdriver-manager in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (3.8.3)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: tqdm in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from webdriver-manager) (4.64.0)
Requirement already satisfied: requests in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from webdriver-manager) (2.27.1)
Requirement already satisfied: python-dotenv in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from webdriver-manager) (0.20.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from requests->webdriver-manager) (3.3)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from requests->webdriver-manager) (2.0.4)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from requests->webdriver-manager) (1.26.9)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from requests->webdriver-manager) (2021.10.8)
Requirement already satisfied: colorama in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from tqdm->webdriver-manager) (0.4.4)

In [17]:
%pip install selenium

Requirement already satisfied: selenium in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (4.4.3)
Requirement already satisfied: urllib3[socks]~=1.26 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from selenium) (1.26.9)
Requirement already satisfied: trio~=0.17 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from selenium) (0.21.0)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from selenium) (0.9.2)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from selenium) (2021.10.8)
Requirement already satisfied: async-generator>=1.9 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio~=0.17->selenium) (1.10)
Requirement already satisfied: outcome in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: sniffio in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: attrs>=19.2.0 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio~=0.17->selenium) (21.4.0)
Requirement already satisfied: sortedcontainers in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: cffi>=1.14 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio~=0.17->selenium) (1.15.0)
Requirement already satisfied: idna in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio~=0.17->selenium) (3.3)
Requirement already satisfied: pycparser in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: wsproto>=0.14 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from urllib3[socks]~=1.26->selenium) (1.7.1)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.13.0)
Note: you may need to restart the kernel to use updated packages.

In [18]:
import pandas as pd
from selenium import webdriver
from selenium.webdriver.chrome.options import Options
from webdriver_manager.chrome import ChromeDriverManager
import requests as req
from bs4 import BeautifulSoup as bs

In [19]:
opciones=Options()

opciones.add_experimental_option('excludeSwitches', ['enable-automation'])
opciones.add_experimental_option('useAutomationExtension', False)
opciones.headless=False    # si True, no aperece la ventana (headless=no visible)
opciones.add_argument('--start-maximized')         # comienza maximizado
#opciones.add_argument('user-data-dir=selenium')    # mantiene las cookies
#opciones.add_extension('driver_folder/adblock.crx')       # adblocker
opciones.add_argument('--incognito')

In [20]:
driver =  ChromeDriverManager().install()
driver = webdriver.Chrome(driver,options = opciones)

In [21]:
import time
import warnings
warnings.filterwarnings('ignore')

In [22]:
from selenium.webdriver.common.by import By

In [23]:
url='https://www.google.com/search?q=cambio+de+euros+a+rupias+en+2017&rlz=1C1CHBF_esES954ES954&ei=XLIRY7DnJMXDgQaM0oco&ved=0ahUKEwiwhda-zPX5AhXFYcAKHQzpAQUQ4dUDCA4&uact=5&oq=cambio+de+euros+a+rupias+en+2017&gs_lcp=Cgdnd3Mtd2l6EAMyBQgAEKIEMgUIABCiBDIFCAAQogQ6CggAEEcQ1gQQsAM6BQgAEIAEOgYIABAeEBY6CAgAEB4QDxAWOggIABAeEBYQCjoFCCEQoAE6CAghEB4QFhAdSgQIQRgASgQIRhgAUJwLWIqYAWCyogFoAXAAeACAAXuIAYoGkgEDNC40mAEAoAEByAEIwAEB&sclient=gws-wiz'

In [24]:
driver.get(url)

In [25]:
cambio_moneda = driver.find_element(By.XPATH, '//*[@id="rso"]/div[1]/div/block-component/div/div[1]/div/div/div/div/div[1]/div/div/div/div/div/div[1]/div/span/span/b')
cambio_moneda

In [26]:
cambio_moneda=cambio_moneda.text.split()[3]
cambio_moneda

'73,5324'

In [27]:
#Ya tenemos el dato de cambio, creamos 2 nuevas columnas en el data (una con precio y otra con cambio)

In [28]:
data['Change']= 73.53

In [29]:
data['Change'].unique()

array([73.53])

In [30]:
data['Change'] = data['Change'].astype('float')

In [31]:
data['Change'].unique()

array([73.53])

In [32]:
data['MonthlyIncome']

0       5993
1       5130
2       2090
3       2909
4       3468
        ...
1465    2571
1466    9991
1467    6142
1468    5390
1469    4404
Name: MonthlyIncome, Length: 1470, dtype: int64

In [33]:
data['Euro'] = (data['MonthlyIncome'] / data['Change'])*12
data['Euro']

0        978.049776
1        837.209302
2        341.085271
3        474.745002
4        565.973072
           ...
1465     419.583843
1466    1630.518156
1467    1002.366381
1468     879.640963
1469     718.727050
Name: Euro, Length: 1470, dtype: float64

In [34]:
data.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 32 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   Department                1470 non-null   object
 4   DistanceFromHome          1470 non-null   int64
 5   Education                 1470 non-null   int64
 6   EducationField            1470 non-null   object
 7   EmployeeNumber            1470 non-null   int64
 8   EnvironmentSatisfaction   1470 non-null   int64
 9   Gender                    1470 non-null   object
 10  JobInvolvement            1470 non-null   int64
 11  JobLevel                  1470 non-null   int64
 12  JobRole                   1470 non-null   object
 13  JobSatisfaction           1470 non-null   int64
 14  MaritalStatus             1470 non-null   object
 15  MonthlyIncome             1470 non-null   int64
 16  NumCompaniesWorked        1470 non-null   int64
 17  OverTime                  1470 non-null   object
 18  PercentSalaryHike         1470 non-null   int64
 19  PerformanceRating         1470 non-null   int64
 20  RelationshipSatisfaction  1470 non-null   int64
 21  StockOptionLevel          1470 non-null   int64
 22  TotalWorkingYears         1470 non-null   int64
 23  TrainingTimesLastYear     1470 non-null   int64
 24  WorkLifeBalance           1470 non-null   int64
 25  YearsAtCompany            1470 non-null   int64
 26  YearsInCurrentRole        1470 non-null   int64
 27  YearsSinceLastPromotion   1470 non-null   int64
 28  YearsWithCurrManager      1470 non-null   int64
 29  idcategory                1470 non-null   int64
 30  Change                    1470 non-null   float64
 31  Euro                      1470 non-null   float64
dtypes: float64(2), int64(22), object(8)
memory usage: 1.0 MB

In [35]:
#Importamos tabla de INE (Salario medio anual por grupos de ocupación y periodo)

In [36]:
url2='https://www.ine.es/buscar/searchResults.do?Menu_botonBuscador=&searchType=DEF_SEARCH&startat=0&L=0&searchString=10916'

In [37]:
PATH=ChromeDriverManager().install()      

driver=webdriver.Chrome(PATH)  

driver.get(url2)  

time.sleep(2)

In [38]:
s=driver.find_element(By.XPATH, '//*[@id="tabsResult"]/ul/li[1]/ul/li[1]').click()

In [39]:
s=driver.find_elements(By.CLASS_NAME, 'main')
s

[]

In [40]:
#No consigo descargar el documento
# Importamos el excel (ingresos) y lo limpiamos. 'Salario anual por actividad económica,'

In [41]:
ingresos = pd.read_excel('../Proyecto/ingresos.xlsx')

In [42]:
ingresos.shape

(16, 3)

In [43]:
ingresos.head()

                                           Actividad   Hombre    Mujer
0  K Trabajadores cualificados de la construcción...  20303.3 -14939.1
1     N Conductores y operadores de maquinaria móvil  20452.2  18549.2
2  B Técnicos y profesionales científicos e intel...  34790.1  30166.1
3  I Trabajadores de los servicios de protección ...  28803.0  24439.8
4                            A Directores y gerentes  55478.0  42901.3

In [44]:
ingresos.columns

Index(['Actividad', 'Hombre', 'Mujer'], dtype='object')

In [45]:
ingresos.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Actividad  16 non-null     object
 1   Hombre     16 non-null     float64
 2   Mujer      16 non-null     float64
dtypes: float64(2), object(1)
memory usage: 2.5 KB

In [46]:
Salario_medio= (ingresos['Hombre'] + ingresos['Mujer']) / 2
Salario_medio

0      2682.10
1     19500.70
2     32478.10
3     26621.40
4     49189.65
5     22928.95
6     15984.20
7     28824.75
8     35988.15
9     15484.40
10    19570.45
11    16554.40
12    22381.45
13    20685.25
14    13962.65
15   -17110.50
dtype: float64

In [47]:
ingresos['ingreso_medio']=Salario_medio

In [48]:
cat=list(range(1,16+1))
cat

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]

In [49]:
ingresos['idcategory'] = cat

In [50]:
ingresos.head()

,Actividad,Hombre,Mujer,ingreso_medio,idcategory
0,K Trabajadores cualificados de la construcción...,20303.3,-14939.1,2682.10,1
1,N Conductores y operadores de maquinaria móvil,20452.2,18549.2,19500.70,2
2,B Técnicos y profesionales científicos e intel...,34790.1,30166.1,32478.10,3
3,I Trabajadores de los servicios de protección ...,28803.0,24439.8,26621.40,4
4,A Directores y gerentes,55478.0,42901.3,49189.65,5

In [51]:
data.to_excel('../Proyecto/Result_datos/data.xlsx', index=False)

In [52]:
data.to_excel('../Proyecto/Result_datos/ingresos.xlsx', index=False)

In [53]:
ingresos.head()

,Actividad,Hombre,Mujer,ingreso_medio,idcategory
0,K Trabajadores cualificados de la construcción...,20303.3,-14939.1,2682.10,1
1,N Conductores y operadores de maquinaria móvil,20452.2,18549.2,19500.70,2
2,B Técnicos y profesionales científicos e intel...,34790.1,30166.1,32478.10,3
3,I Trabajadores de los servicios de protección ...,28803.0,24439.8,26621.40,4
4,A Directores y gerentes,55478.0,42901.3,49189.65,5

In [54]:
ingresos.columns

Index(['Actividad', 'Hombre', 'Mujer', 'ingreso_medio', 'idcategory'], dtype='object')

In [55]:
data.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'Department', 'DistanceFromHome',
       'Education', 'EducationField', 'EmployeeNumber',
       'EnvironmentSatisfaction', 'Gender', 'JobInvolvement', 'JobLevel',
       'JobRole', 'JobSatisfaction', 'MaritalStatus', 'MonthlyIncome',
       'NumCompaniesWorked', 'OverTime', 'PercentSalaryHike',
       'PerformanceRating', 'RelationshipSatisfaction', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager', 'idcategory', 'Change', 'Euro'],
      dtype='object')

In [56]:
%pip install pymongo

Requirement already satisfied: pymongo in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (4.2.0)Note: you may need to restart the kernel to use updated packages.

In [57]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\joser\onedrive\documentos\anaconda\anaconda\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [63]:
from sqlalchemy import create_engine

In [64]:
str_conn='mysql+pymysql://root:password@localhost:3306/mydb'

cursor=create_engine(str_conn)

In [65]:
ingresos.to_sql(name='ingresos', con=cursor, if_exists='replace', index=False)

16

In [66]:
data.to_sql(name='data', con=cursor, if_exists='replace', index=False)

1470